tutorials/multiphase/interDyMFoam/ras/floatingObject/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1 0
);

regions
(
    boxToCell
    {
        box ( -100 -100 -100 ) ( 100 100 0.5368 );
        fieldValues ( volScalarFieldValue alpha1 1 );
    }

    boxToCell
    {
        box ( 0.7 0.8 -100 ) ( 100 100 0.65 );
        fieldValues ( volScalarFieldValue alpha1 1 );
    }
);

// ************************************************************************* //
